# SetVPClOvrdLineStyle

```pascal
PROCEDURE SetVPClOvrdLineStyle(
				viewportHandle : HANDLE;
				className      : STRING;
				lineStyle      : LONGINT);
```

```python
def vs.SetVPClOvrdLineStyle(viewportHandle, className, lineStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The handle of the viewport.|
|className|STRING|The name of the class|
|lineStyle|LONGINT|The line style to be set to the class override|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports